#! /usr/bin/env python
#-*- encoding: utf-8 -*-
## 数据转换配置

# ----------------------------------------------------------------
# 路径配置
# ----------------------------------------------------------------

# 多语言版本可以在此处定义
path = {
        "zh_cn": {
            # 源文件目录
            "xlsx": "./cfg/data/",
            # 客户端生成目录
            "cli": "./out/cli/",
            # 服务端生成目录
            "svr": "../../server/src/data/"
            },
        "zh_tw": {
            # 源文件目录
            "xlsx": "./cfg/data_zh_tw/",
            # 客户端生成目录
            "cli": "./out/cli_tw/",
            # 服务端生成目录
            "svr": "../../server/src/data/"
            }
        }
